app/controllers/admin/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "啦啦啦啦啦啦啦hahah "], ["updated_at", "2015-08-28 07:31:07.155855"], ["id", 1]]
---
  def set_recommend
    @recommend = Post.find(params[:post_id])
    @recommend.update(is_recommend: true)